app/controllers/posts_controller.rb

	def index
		@posts = Post.all.order("created_at desc").paginate(page: params[:page], per_page: 5)
---
SELECT "posts".* FROM "posts"  ORDER BY created_at desc
SELECT COUNT(*) FROM "posts"

	def create
		@post = Post.new post_params

		if @post.save
---
INSERT INTO "posts" ("title", "content", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "new test"], ["content", "This is a test for the friendly_id post"], ["slug", "new-test"], ["created_at", "2016-08-01 20:48:42.829287"], ["updated_at", "2016-08-01 20:48:42.829287"]]

	def update
		if @post.update post_params
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "test update 1"], ["updated_at", "2016-08-01 18:43:16.039432"], ["id", 1]]

	def find_post
		@post = Post.friendly.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]