app/controllers/projects_controller.rb

	def index
		@projects = Project.all.order("created_at desc")
---
SELECT "projects".* FROM "projects"  ORDER BY created_at desc

	def create
		@project = Project.new project_params

		if @project.save
---
INSERT INTO "projects" ("title", "description", "link", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)